Tekla Open API Reference for Tekla Structures 2025
Identifier Constructor (String)
 Constructs an identifier with the given GUID string.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Identifier(
	string guid
)
Public Sub New (
	guid As String
)
Parameters
guid
Type: System.String
The GUID to be used.
See Also
Reference
Identifier Class
Identifier Overload
Tekla.Structures Namespace